issues/3.org
#+options: toc:nil
#+latex_header: \usepackage[margin=1in]{geometry}

* Issue 3
   It is not clear whether /local nicknames/ of the /current package/ should
   affect ~make-package~ or ~defpackage~.
** Example
   #+BEGIN_SRC common-lisp
   (defpackage #:a (:use) (:export #:x))
   (defpackage #:b (:use) (:export #:x))
   (defpackage #:c
     (:use #:cl)
     (:local-nicknames (#:a #:b) (#:b #:a)))

   (in-package #:c)
   (defpackage #:d
     (:use #:a)
     (:export #:x))
   (print (package-name (symbol-package 'd:x)))
   ; => "B"  (sbcl, ccl, acl, abcl)
   ; => "A"  (ecl, clasp)

   (defpackage #:e
     (:use)
     (:local-nicknames (#:x #:a)))

   (let ((*package* (find-package '#:e)))
     (print (package-name (find-package '#:x))))
   ; => "B"  (ccl, acl, abcl)
   ; => "A" (sbcl, ecl, clasp)
   #+END_SRC
** Proposal
   They should affect all options like ~:use~, ~:local-nicknames~,
   ~:shadowing-import-from~ and ~:import-from~.
** Currently
   ccl, acl, abcl: they do.

   sbcl: partly (:use is affected, :local-nicknames are not)

   ecl, clasp: they don't.
